#language: ru
Функционал: Кошкины лакомства


  @web
  Сценарий: Выбираем лакомства

    * подтвержден регион
    * открываем все категории
    * наводим на пункт меню "Товары для животных"
    * выбран подпункт меню "Лакомства"
    * кликаем производителя "Felix"
    * жмем на с доставкой
    * цена от "50"
    * цена до "150"
    * выбираем товар под номером "0"
    * добавляем в сравнение
    * кликаем производителя "Felix"
    * кликаем производителя "Мнямс"
    * выбираем товар под номером "1"
    * добавляем в сравнение
    * переход в сравнение
    * итоговая сумма меньше "300"
#    * проверяем товары в списке сравнения
    * удалить и проверить отсутствие товара под маркой "Felix"
    * удалить список и проверить отсутствие товаров
